src/InformationRegisters/МП_СинхронизацияПроектов/МП_СинхронизацияПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МП_СинхронизацияПроектов</name>
  <resources>
    <name>ОтметкаВремени</name>
    <type>
      <types>DefinedType.ОтметкаВремени</types>
    </type>
  </resources>
  <attributes>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ФактическиеТрудозатраты/ФактическиеТрудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФактическиеТрудозатраты</name>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьСверхурочно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьВВыходные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕжедневныйОтчет</name>
    <type>
      <types>DocumentRef.ЕженедельныйОтчет</types>
      <types>DocumentRef.ЕжедневныйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРаботы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Контроль</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ЕженедельныйОтчет</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>DocumentRef.Отсутствие</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>DocumentRef.ЕжедневныйОтчет</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроектнаяЗадача</name>
    <type>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьОписаниеРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДобавления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом/ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом</name>
  <resources>
    <name>ОтметкаВремени</name>
    <type>
      <types>DefinedType.ОтметкаВремени</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>EnumRef.ВидыНастроекОбменаСМобильнымКлиентом</types>
      <types>EnumRef.ОбменСМобильнымиТипыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ОбменСМобильнымиТипыНастроекПользователей/ОбменСМобильнымиТипыНастроекПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбменСМобильнымиТипыНастроекПользователей</name>
  <enumValues>
    <name>ВидРаботПоУмолчанию</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьPushУведомления</name>
  </enumValues>
  <enumValues>
    <name>МаксимальныйРазмерВложения</name>
  </enumValues>
  <enumValues>
    <name>МаксимальныйРазмерФайлов</name>
  </enumValues>
  <enumValues>
    <name>ОграничениеФорматовПередаваемыхФайлов</name>
  </enumValues>
  <enumValues>
    <name>ПериодПервичнойЗагрузки</name>
  </enumValues>
  <enumValues>
    <name>ПодробныйПротоколОбменаСМобильнымУстройством</name>
  </enumValues>
  <enumValues>
    <name>ПроектПоУмолчанию</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияАдреснойКниги</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияЗадач</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияКалендаря</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияКонтроля</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияМероприятий</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияОтсутствий</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияПочты</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияСамочувствий</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияУчетаВремени</name>
  </enumValues>
  <enumValues>
    <name>СпособУказанияВремени</name>
  </enumValues>
  <enumValues>
    <name>СрокУстареванияДанных</name>
  </enumValues>
  <enumValues>
    <name>ФорматыПередаваемыхФайлов</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/МП_СинхронизацияПроектов/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает проектя для синхронизации пользователя.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Обрабатываемый пользователь.
// Возвращаемое значение:
//  Таблица - Таблица с колонками "Проект", "Выбран".
Функция ТаблицаПроектыДляСинхронизации(Пользователь, СоставПроектовИзменился) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МП_СинхронизацияПроектов.Проект КАК Проект,
		|	ИСТИНА КАК Выбран
		|ИЗ
		|	РегистрСведений.МП_СинхронизацияПроектов КАК МП_СинхронизацияПроектов
		|ГДЕ
		|	МП_СинхронизацияПроектов.Пользователь = &Пользователь
		|
		|УПОРЯДОЧИТЬ ПО
		|	Проект
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить();
	Иначе
		СоставПроектовИзменился = Истина;
		Возврат ТаблицаПроектыДляСинхронизацииПоУмолчанию(Пользователь);
	КонецЕсли;
	
КонецФункции

// Получает проекты для синхронизации по умолчанию
//
// Параметры:
//  Пользователь - Необходимый пользователь 
// Возвращаемое значение:
//  Таблица - Таблица с колонками "Проект", Выбран.
Функция ТаблицаПроектыДляСинхронизацииПоУмолчанию(Пользователь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФактическиеТрудозатраты.Проект КАК Проект,
		|	ИСТИНА КАК Выбран
		|ИЗ
		|	РегистрСведений.ФактическиеТрудозатраты КАК ФактическиеТрудозатраты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|		ПО ФактическиеТрудозатраты.Проект = Проекты.Ссылка
		|ГДЕ
		|	ФактическиеТрудозатраты.Пользователь = &Пользователь
		|	И ФактическиеТрудозатраты.ДатаДобавления >= &ДатаУстаревания
		|	И НЕ ФактическиеТрудозатраты.Удалена
		|
		|СГРУППИРОВАТЬ ПО
		|	ФактическиеТрудозатраты.Проект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Проект
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	ДатаУстаревания = РегистрыСведений.ОбменСМобильнымиНастройкиПользователей.ДатаУстаревания(Пользователь);
	Запрос.УстановитьПараметр("ДатаУстаревания", ДатаУстаревания);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();
		
КонецФункции

Функция Добавить(Пользователь, Проект, Удален = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МЗ = СоздатьМенеджерЗаписи();
	МЗ.Проект = Проект;
	МЗ.Пользователь = Пользователь;
	МЗ.Удален = Удален;
	МЗ.ОтметкаВремени = ОтметкиВремени.Текущая();
	МЗ.Записать();
	
КонецФункции

//Определяем учавствует ли проект в синхронизации и если нет - добавляет в синхронизацию
//Параметры
// Пользователь - Справочник.Пользователи - пользователь, по которому происходит проверка
// Проект - Справочник.Проект - проверяемый проект
Процедура СинхронизироватьПроектПриНеобходимости(Пользователь, Проект, ПроектПоУмолчанию = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Новый выбранный проект пользователем в отчетах нужно добавить в синхронизацию,
	//для чтобы на мобильном не было битых ссылок
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МП_СинхронизацияПроектов.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.МП_СинхронизацияПроектов КАК МП_СинхронизацияПроектов
		|ГДЕ
		|	МП_СинхронизацияПроектов.Пользователь = &Пользователь
		|	И МП_СинхронизацияПроектов.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Добавить(Пользователь, Проект);
		
	КонецЕсли;
	
	Если ПроектПоУмолчанию Тогда
		
		//Добавляем изменение умолчательного проекта для выгрузки на мобильный
		РегистрыСведений.ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом.ДобавитьЗапись(Пользователь,
			Перечисления.ОбменСМобильнымиТипыНастроекПользователей.ПроектПоУмолчанию);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
